app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello Title"], ["body", "This is my body"], ["created_at", "2016-03-13 22:23:00.963568"], ["updated_at", "2016-03-13 22:23:00.963568"]]

  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Real Title"], ["body", "Body is fake"], ["updated_at", "2016-03-13 22:58:31.161735"], ["id", 15]]